from aiogram import types
from loader import dp
from aiogram.dispatcher.filters.builtin import Command


@dp.message_handler(Command("advices"))
async def advices(message: types.Message):
    await message.answer("Отже, ти прийшов сюди за порадою і ти їх отримаєш, але для початку, декілька слів про те хто я:\n\n"
                         "Мене звати Макс і на сьогоднішній день я є студентом другого курсу Національного Університету Водного Господарства та Природокористування."
                         " Навчаюся я за спеціальністю Інженерія Програмного Забезпечення🧑‍💻.\n\n"
                         "Не важко порахувати коли я сам здавав це 'страшнюче' ЗНО, це було в 2020 році і я його склав на 190 балів. Вважаю цей результат не ідеальним, але й не поганим."
                         "\nТому ось довгоочікувані поради особисто від мене:\n\n"
                         "1️⃣ Для початку потрібно перестати думати, що цей тест це найважливіше, що є в твоєму житті, це далеко не так😅\n"
                         "2️⃣ Але все ж, це важливий етап в житті, який в певній мірі вплине на твою долю, тож якщо бажаєш потрапити в омріяний університет - потрібно багато працювати😮‍💨\n"
                         "3️⃣ Сам особисто дуже вдячний <a href='https://www.youtube.com/c/%D0%BD%D0%B0%D0%B2%D1%81%D1%96%D0%B4%D0%B2%D1%96%D1%81%D1%82%D1%96'>цьому</a> каналу і Анні Огойко яка мене готувала до ЗНО через свої відеоуроки, вони просто бомбезні🌟\n"
                         "4️⃣ Напевно найочевидніша порада, просто проходь тести в нашому боті, або на <a href='https://zno.osvita.ua/ukrainian/'>ось цій</a> сторінці, з якої я відповідно і черпаю ці питання😁\n"
                         "5️⃣ Ну і найголовніше, пам'ятай, що ти розумний/розумна і тобі все вдастся, я в тебе вірю так само як і в перемогу нашої країни над окупантами🇺🇦❤")

