import asyncio
from utils.dp_api.postgresql import Database


async def test():
    await db.create()
    await db.delete_questions()
    print('Створюю таблицю')
    await db.create_table_with_questions_litra()
    await db.create_table_with_questions_mova()
    await db.create_table_with_questions_for_nagolos()
    await db.create_table_with_questions_for_apostrof()
    print('Done')

    print('Додаємо запитання')
    # Питання з української літератури
    await db.add_question_to_litra("""Зображене в уривку

– Христос Воскресé! – І розвіявся мóрок.
Упали кайдани з невольницьких рук.
– Спішіть! Байдаки у відкритому морі!
Поблизу нема ні галер, ні фелюк!

суголосне з подіями твору""", '«Віють вітри, віють буйні»', "«Засвіт встали козаченьки»", "«Ой летіла стріла»",
                                   "«Дума про Марусю Богуславку»", "«Ой Морозе, Морозенку»", 4)
    await db.add_question_to_litra(
        "У рядках\n\nБула ж то вчора громовиця!\nПалахкотіло на бійницях,\nі острахом земля здригалась,\nі чи ж не чула це Каяла?\nє алюзія на твір",
        '«Повість минулих літ» (уривок про помсту княгині Ольги)', "«Слово про похід Ігорів»", "«Захар Беркут»",
        "«Чорна рада»", "«Маруся Чурай»", 2)
    await db.add_question_to_litra(
        """«Уперше проста селянська дівчина вийшла на сцену й відразу заговорила щиро й розумно... Довгі чотири роки вона чекає й вірить у неминучу зустріч із коханим», – сказано про""",
        'Лесю Череванівну', "Марисю Борулю", "Софію Дорошенко", "Мелашку Балаш", "Наталку Полтавку", 5)
    await db.add_question_to_litra(
        "«Хоч Січ нам і мати, а Великий Луг – батько, та для такої дівчини можна покинути і батька, і матір», – говорить",
        'Кирило Тур про Лесю', "Гриць Бобренко про Марусю", "Микола Гуляницький про Марисю",
        "Грицько Чупруненко про Христю", "Карпо Кайдаш про Мотрю", 1)
    await db.add_question_to_litra(
        "Історія села Піски, життя українського селянства в часи реформи 1861 року, доля правдошукача-бунтаря, який став злочинцем, – тема",
        'соціально-побутової повісті', "історичного роману", "соціально-психологічного роману", "історичної повісті",
        "соціально-побутової драми", 3)
    await db.add_question_to_litra(
        "Біблійний афоризм «Хто взяв меч, від меча й загине» суголосний із основною проблемою твору",
        '«Наталка Полтавка»', "«Дума про Марусю Богуславку»", "«Мина Мазайло»", "«Захар Беркут»", "«Камінний хрест»", 4)
    await db.add_question_to_litra(
        "«Долі дівчат відтінено звучанням меланхолійного вальсу: завзятого, веселого спочатку й сповненого шукання, суму, розпуки в кінці новели», – сказано про твір",
        'Михайла Коцюбинського', "Василя Стефаника", "Ольги Кобилянської", "Григора Тютюнника", "Ліни Костенко", 3)
    # await db.add_question(a.pop(0), """Прочитайте текст, у якому пропущено окремі фрагменти інформації.

    # «Сюжет __________ взято з часів __________. Соціальні антагонізми, що виявилися відразу по смерті Богдана Хмельницького, служать тлом для історії двох закоханих героїв – __________»

    # Правильним є варіант послідовного заповнення пропусків""", "«Кайдашевої сім'ї»; пореформених; Лавріна Кайдаша та Мелашки Балаш", "«Чорної ради»; Руїни; Петра Шраменка та Лесі Череванівни", "«Мини Мазайла»; українізації; Мокія Мазайла та Улі Розсохи", "«Марусі Чурай»; Національно-визвольної війни; Марусі Чурай та Гриця Бобренка", "«Захара Беркута»; Карпатської Руси; Максима Беркута та Мирослави Вовк", 2)
    await db.add_question_to_litra("Твір «Блакитна Панна» є зразком", 'класицизму', "неоромантизму", "символізму",
                                   "експресіонізму", "постмодернізму", 3)
    await db.add_question_to_litra(
        "«Світи щодня лампаду / Кіпріді добрій», – радить незнайомцеві лірична героїня твору", 'Лесі Українки',
        "Олександра Олеся", "Павла Тичини", "Максима Рильського", "Ліни Костенко", 4)
    await db.add_question_to_litra("Олександр Довженко у творі «Майстер корабля» став прототипом образу", 'Сева',
                                   "Директора", "Професора", "Майка", "Богдана", 1)
    await db.add_question_to_litra("""В уривку

Доки буде жити Україна
В теплім хлібі, в барвних снах дітей –
Йтиме білим полем Катерина
З немовлям, притнутим до грудей

згадано образи з твору""", 'Івана Котляревського', "Михайла Коцюбинського", "Василя Стефаника", "Василя Стефаника",
                                   "Тараса Шевченка", 5)
    await db.add_question_to_litra("""Як я малим збирався навесні
Піти у світ незнаними шляхами,
Сорочку мати вишила мені
Червоними і чорними нитками, –

згадує ліричний герой поезії""", 'Василя Стуса', "Андрія Малишка", "Василя Голобородька", "Дмитра Павличка",
                                   "Василя Симоненка", 4)
    await db.add_question_to_litra("Зразком постмодерної поезії є рядки",
                                   '«Господи, гніву пречистого / благаю – не май за зле. / Де не стоятиму – вистою. / Спасибі за те, що мале / людське життя, хоч надією / довжу його в віки».',
                                   "«Він бігав наввипередки з вітром, / Він вилазив на грушу, і рвав у пазуху гнилиці, / І купався коло млина, і лежав у піску, / І стріляв горобців з рогатки».",
                                   "«Вклякніть, белетристи, / Від Благої Вісти, – / Ми не просто Хтось Там, / – Ми є бубабісти. / Вас навколо Себе / Будем гуртувати».",
                                   "«Все повторялось: і краса, й потворність. / Усе було: асфальти й спориші. Поезія – це завжди неповторність, / якийсь безсмертний дотик до душі»",
                                   "«Рідко, нене, згадую про тебе, / Дні занадто куці та малі, / Ще не всі чорти живуть на небі, / Ходить їх до біса на землі».",
                                   3)
    await db.add_question_to_litra("""Рядки
    Місяць на небі, зіроньки сяють,
    Тихо по морю човен пливе.
    В човні дівчина пісню співає,
    А козак чує – серденько мре…
узято з""", 'народної думи', "історичної пісні", "родинно-побутової пісні", "суспільно-побутової пісні",
                                   "календарно-обрядової пісні", 3)
    await db.add_question_to_litra(
        "Сон Святослава, поразка русичів на річці Каялі, плач Ярославни – це епізоди твору, де є образ", 'співця Бояна',
        "козака Енея", "боярина Тугара Вовка", "бранки Марусі Богуславки", "гетьмана Богдана Хмельницького", 1)
    await db.add_question_to_litra(
        "Пошуки суспільної сили (національної еліти), яка спроможна згуртувати народ (націю), зміцнити державу, – одна з проблем твору",
        '«Всякому місту – звичай і права…»', "«Кайдашева сім’я»", "«Тіні забутих предків»", "«Майстер корабля»",
        "«Чорна рада»", 5)
    await db.add_question_to_litra("Дійовими особами першого драматичного твору нової української літератури є",
                                   'Тетерваковський і Терпилиха', "Лукаш і Мавка", "Боруля і Красовський",
                                   "Мокій і Уля", "Кайдаш і Кайдашиха", 1)
    await db.add_question_to_litra("У жанрі послання написано твір, у якому є рядки",
                                   "«І мене в сім’ї великій, / В сім’ї вольній, новій,\nНе забудьте пом’янути / Незлим тихим словом…»",
                                   "«За горами гори, хмарою повиті,/ Засіяні горем, кровію политі.\nСпоконвіку Прометея / Там орел карає...»",
                                   "«Кохайтеся, чорнобриві, / Та не з москалями,\nБо москалі – чужі люде, / Роблять лихо з вами…»",
                                   "«Якби ви вчились так, як треба, / То й мудрость би була своя.\nА то залізете на небо: / — І ми – не ми, і я – не я!..»",
                                   "«Мій медведик! Стоїть собі, / Голову понурив,\nСіромаха. Де ж ділася / Медвежа натура? / Мов кошеня, такий чудний…»",
                                   4)
    await db.add_question_to_litra("У творі «Маруся Чурай» однією з центральних є проблема",
                                   'зумисної русифікації україномовного населення',
                                   "фатального зіткнення духовного й матеріального",
                                   "трагічної боротьби за гетьманську владу",
                                   "нестерпного становища покріпаченого селянства",
                                   "відповідальності людини за збереження довкілля", 2)
    await db.add_question_to_litra(
        "Словами «Чим ми побідили? Чи нашим оружжям тілько? Ні. Чи нашою хитрістю тілько? Ні. Ми побідили нашим громадським ладом, нашою згодою і дружністю. Уважайте добре на се…» звертається до однодумців",
        'Іван Брюховецький', "Григорій Многогрішний", "князь Ігор", "Захар Беркут", "доктор Тагабат", 4)
    await db.add_question_to_litra(
        "Фантастичний політ оповідача за совою з України до Сибіру й далі до Петербурга зображено у творі",
        '«Тіні забутих предків»', "«Хіба ревуть воли, як ясла повні?»", "«Сон» («У всякого своя доля …»)",
        "«Три зозулі з поклоном»", "«Тигролови»", 3)
    await db.add_question_to_litra(
        "Словами «Прийми ж сей спів, хоч тугою повитий, / Та повний віри; хоч гіркий, та вільний, / Твоїй будущині задаток, слізьми злитий, / Твойому генію мій скромний дар весільний» звертається до свого народу ліричний герой твору",
        'Євгена Маланюка', "Івана Котляревського", "Григорія Сковороди", "Тараса Шевченка", "Івана Франка", 5)
    await db.add_question_to_litra(
        "Уславлення борців за вільну Україну на початку ХХ ст. – ідея твору, де наявні óбрази",
        'Аскольдова могила; кривава дорога; Дніпро-ріка', "синова колиска; Батьківщина; рідна мати",
        "Чорне море; бідні невольники; пан турецький", "далека дорога; материнська усмішка; рушник вишиваний",
        "лемки у крисанях; місяць круглий; снігова завія", 1)
    await db.add_question_to_litra("Проблема емансипації жінки та її самореалізації є ключовою у творі",
                                   '«О панно Інно...»', "«Valse mélancolique»", "«Блакитна Панна»", "«Я (Романтика)»",
                                   "«Дума про Марусю Богуславку»", 2)
    await db.add_question_to_litra("«Любові всевишній» автор присвячує твір, у якому зображено «любовний трикутник»",
                                   'Софія – Михайло – Марфа', "Мавка – Лукаш – Килина", "Маруся – Гриць – Галя",
                                   "Микола – Марися – Націєвський", "Петро – Наталка – Тетерваковський", 1)
    await db.add_question_to_litra("Слова «Без надії таки сподіватись» – провідний мотив твору, де є рядки",
                                   '«В житті ти мною згордувала, / Моє ти серце надірвала...»',
                                   "«Я на вбогім сумнім перелозі / Буду сіять барвисті квітки...»",
                                   "«Я ж у полоні нав’язливих дум: / Лише одне непокоїть мій ум...»",
                                   "«О слово рідне! Шум дерев! / Музика зір блакитнооких...»",
                                   "«Сьогодні усе для тебе – / Озера, гаї, степи...»", 2)
    await db.add_question_to_litra("Ознаки постмодернізму відчутні в рядках", """«Ради тебе перли в душу сію, / Ради тебе мислю і творю…
Хай мовчать Америки й Росії, / Коли я з тобою говорю».""", """«І оживе добра слава, / Слава України,
І світ ясний, невечерній / Тихо засіяє».""", """«Хай згинуло, хай загуло – / Вони лишилися, як криця!
І жадний примус, жадне зло / Їх не примусило скориться!»""", """«скрипка люлька коломийка і колекція наліпок
він не вмер він ще стріляє вічний революцьйонер».""", """«Красиве засмагле сонце / В золотих переливах кучерів,
У червоній сорочці навипуск, / Що їхало на велосипеді…»""", 4)
    await db.add_question_to_litra("Перемогу козаків під Жовтими Водами оспівано у творі", '«Засвіт встали козаченьки»',
                                   "«Чи не той то хміль»", "«Ой Морозе, Морозенку»", "«Ой летіла стріла»",
                                   "«Дума про Марусю Богуславку»", 2)
    await db.add_question_to_litra("""Уривок

Недобреє віщує Див. / Лише в один кінець сліди. / А сурми сурмлять
войовничо. / Степ майорить і кличе, кличе. / Іти за Дін чи не іти, / шоломом
зачерпнуть води?

суголосний з подіями твору""", '«Чорна рада»', "«Слово про похід Ігорів»", "«Захар Беркут»", "«Тіні забутих предків»",
                                   "«Чи не той то хміль»", 2)
    await db.add_question_to_litra(
        "«Лише з великої висоти можна було розгледіти підвалини Миколаївської імперії і вже в 1844 р. побачити царя жалюгідним ведмедиком, на очах якого всі ці підвалини провалюються», – сказано про твір",
        'Івана Котляревського', "Панаса Мирного", "Івана Франка", "Тараса Шевченка", "Пантелеймона Куліша", 4)
    await db.add_question_to_litra("Найважливіші етапи визвольних змагань українського народу осмислено в поезії",
                                   '«Господи, гніву пречистого…»', "«Балада про соняшник»", "«Два кольори»",
                                   "«Уривок з поеми»", "«Страшні слова, коли вони мовчать…»", 4)
    await db.add_question_to_litra("У жанрі новели написано обидва твори рядка",
                                   '«Я (Романтика)» і «Моя автобіографія»',
                                   "«Три зозулі з поклоном» і «Майстер корабля»",
                                   "«Valse melancolique» і «Зачарована Десна»", "«Камінний хрест» і «Захар Беркут»",
                                   "«Intermezzo» і «Модри Камень»", 5)
    await db.add_question_to_litra("Підзаголовок «Образ громадського життя Карпатської Руси в ХІІІ віці» має твір",
                                   '«Тіні забутих предків»', "«Захар Беркут»", "«Захар Беркут»",
                                   "«Слово про похід Ігорів»", "«Хіба ревуть воли, як ясла повні?»", 2)
    await db.add_question_to_litra("Зразком неокласичної інтимної лірики є твір", '«У теплі дні збирання винограду…»',
                                   "«Ви знаєте, як липа шелестить…»", "«Чого являєшся мені у сні?..»", "«Чари ночі»",
                                   "«Задивляюсь у твої зіниці…»", 1)
    await db.add_question_to_litra("Образ весни, яка «лине вся в прозорих шатах, у серпанках і блаватах», створив",
                                   'Іван Франко', "Олександр Олесь", "Павло Тичина", "Микола Вороний",
                                   "Максим Рильський", 4)
    await db.add_question_to_litra("""У рядках

…Коли ти навіть звався – Малоросія, / твоя поетеса була Українкою!

згадано автора слів""", '«Все покину і полину / До самого Бога...»', "«Піди збуди, цілуй їй очі...»",
                                   "«Все повторялось: і краса, й потворність...»", "«Любіть Україну у сні й наяву...»",
                                   "«Без надії таки сподіватись...»", 5)
    await db.add_question_to_litra(
        "Особистий досвід автора під час роботи на Одеській кінофабриці покладено в основу твору", '«Місто»',
        "«Моя автобіографія»", "«Майстер корабля»", "«Мина Мазайло»", "«Модри Камень»", 3)
    await db.add_question_to_litra(
        "У рядках «кожне слово / нашої мови / проспіване у Пісні / тож пісенними словами / з побратимами / у товаристві розмовляємо» красу й багатство рідної мови розкриває",
        'Василь Симоненко', "Дмитро Павличко", "Василь Стус", "Євген Маланюк", "Василь Голобородько", 5)
    await db.add_question_to_litra("Зразком усної народної творчості є рядки",
                                   'Сіла край серденька – / То його миленька…',
                                   "Я закохавсь в гучних віках, / Я волю полюбив державну…",
                                   "А вона, як мрія сну / Чарівна, / Сяє вродою святою…",
                                   "Чого звертаєш ти до мене / Чудові очі ті ясні..?",
                                   "Може, квіти зійдуть – і настане / Ще й для мене весела весна…", 1)
    await db.add_question_to_litra("Засудження загарбницької політики Російської імперії – ідея твору",
                                   '«Слово про похід Ігорів»', "«Чорна рада»", "«Захар Беркут»", "«Кавказ»",
                                   "«Модри Камень»", 4)
    await db.add_question_to_litra(
        "У творі «Хіба ревуть воли, як ясла повні?» селяни не довірили Чіпці пасти громадську отару, бо",
        'він пристав до «лихого товариства»', "його мати конфліктувала з односельцями",
        "вважали його молодим і ненадійним", "той злякався вовка, який викрав ягнятко", "хлопця мали віддати в рекрути",
        3)
    await db.add_question_to_litra(
        "Наказний гетьман, вірний послідовник політики Богдана Хмельницького, шляхетний, мужній – так можна схарактеризувати",
        'Івана Іскру', "Івана Брюховецького", "Якима Сомка", "Мартина Пушкаря", "Івана Шрама", 3)
    await db.add_question_to_litra("""Рядки з пісні

Чути: кру-кру-кру, / В чужині умру, / Заки море перелечу, / Крилонька зітру суголосні з проблематикою твору""",
                                   '«Камінний хрест»', "«Valse melancolique»", "«Я (Романтика)»", "«Захар Беркут»",
                                   "«Тіні забутих предків»", 1)
    await db.add_question_to_litra(
        "Словами «Я душу дав тобі? А тіло збавив! / Бо що ж тепера з тебе? Тінь! Мара!..» звертається",
        'Іван до Катерини', "Чіпка до Галі", "Лаврін до Мелашки", "Іван до Марічки", "Лукаш до Мавки", 5)
    await db.add_question_to_litra("""Україно, ти моя молитва, / Ти моя розпука вікова…
Гримотить над світом люта битва / За твоє життя, твої права… –

стверджує ліричний герой поезії""", 'Тараса Шевченка', "Івана Франка", "Олександра Олеся", "Павла Тичини",
                                   "Василя Симоненка", 5)
    await db.add_question_to_litra("«Сміхом крізь сльози» можна схарактеризувати зображене в обох творах рядка",
                                   '«Бджола та Шершень» і «Кайдашева сім’я»', "«Мартин Боруля» і «Чорна рада»",
                                   "«Я (Романтика)» і «Бджола та Шершень»", "«Три зозулі з поклоном» і «Я (Романтика)»",
                                   "«Кайдашева сім’я» і «Мартин Боруля»", 5)
    await db.add_question_to_litra(
        "«Торкнувся склянки білими вустами. / Повільно пив. І випив. І погас. / О сонце, сонце, промінь мій останній! / Оце і є вся правдонька про нас…», – розповідає про свого коханого",
        'Софія Дорошенко', "Маруся Чурай", "княгиня Ольга", "Маруся Богуславка", "Леся Череванівна", 2)
    await db.add_question_to_litra(
        "Справжнє ім’я автора, який розповів про українську родину Сірків із Зеленого Клину,–", 'Іван Левицький',
        "Панас Рудченко", "Іван Тобілевич", "Микола Фітільов", "Іван Лозов’ягін", 5)
    await db.add_question_to_litra("Композиційною особливістю твору «Зачарована Десна» є", 'дві кульмінаційні вершини',
                                   "двоплановість зображення", "наявність прологу", "розповідь від третьої особи",
                                   "відсутність діалогів", 2)
    # Питання з української мови

    await db.add_question_to_mova("Букву и треба писати на місці пропуску в усіх словах рядка",
                                  "височ..на, відгр..міти, вогн..ще", "власн.ця, кош..чок, пост..лити",
                                  "заб..рати, ч..рговий, тр..вожний", "печ..во, шел..стіння, др..жати", 1)
    await db.add_question_to_mova("М'який знак треба писати на місці пропуску в усіх словах рядка",
                                  "кан..йон, учител..ський, камін..чик", "жен..шеневий, одягаєт..ся, чотир..ма",
                                  "повін..чати, слиз..кий, малесен..кий", "жмен..ці, порт..єрний, виріз..блений", 4)
    await db.add_question_to_mova("Подвоєні букви треба писати в усіх словах рядка", "чесніст..ю, повін..ю, піч..ю",
                                  "детал..ю, сіл..ю, радіст..ю", "розповід..ю, рис..ю, віс..ю",
                                  "розповід..ю, рис..ю, віс..ю", 3)
    await db.add_question_to_mova("Разом треба писати всі слова в рядку", "від/тепер, на/далі, що/вівторка",
                                  "без/вісти, по/перше, аби/куди", "по/волі, до/вподоби, на/вмання",
                                  "зі/споду, по/суті, по/тихеньку", 1)
    await db.add_question_to_mova("Правил уживання великої букви дотримано в реченні",
                                  "На Майдані Свободи в Харкові на Новий Рік зазвичай установлюють велику штучну ялинку.",
                                  "Наша Сонячна система – частина галактики Чумацький Шлях, яка є лише піщинкою у Всесвіті.",
                                  "У серпні 1991 року Верховна рада України ухвалила Акт проголошення Незалежності України.",
                                  "За міфами, гора Парнас – це місцеперебування Бога Аполлона та його супутниць – дев'яти Муз.",
                                  2)
    await db.add_question_to_mova("НЕМАЄ орфографічних помилок у варіанті",
                                  "Ніколи не купайтесь у не знайомій водоймі, не переконавшись спочатку, що там цілком беспечно.",
                                  "Якщо погано плаваєте, то не купайтеся наодинці й не заходьте у воду надто глибоко.",
                                  "Не пірнайте, якщо ще невправні в цьому, бо наражаїтеся на ризик ударитися об дно.",
                                  "Якщо зтомилися, переверніться на спину: так зможете вітпочити, просто полежавши на поверхні води.",
                                  2)
    await db.add_question_to_mova("Спільнокореневими до слова крити є всі слова, ОКРІМ", "відкриття", "закривати",
                                  "скривити", "покрівля", 3)
    await db.add_question_to_mova("Букву е треба писати на місці пропуску в усіх словах рядка",
                                  "об…режно, тр…вожний, пол…тіти", "мер..хтіння, вч..нити, ол..нятко",
                                  "підгр..бти, зач..кати, надв..чірок", "вел..тень, гр..мить, кр..мезний", 3)
    await db.add_question_to_mova("Апостроф на місці пропуску треба писати в усіх словах рядка",
                                  "пуп..янок, м..юзикл, арф..яр", "н..юанс, матір..ю, між..ярусний",
                                  "кав..ярня, розв..язка, дит..ясла", "м..якоть, п..єдестал, б..юлетень", 3)
    await db.add_question_to_mova("Суфікс -ств- треба писати в іменниках, утворених від обох слів у рядку",
                                  "дитина, пірат", "козак, товариш", "студент, жінка", "будівник, брат", 1)
    await db.add_question_to_mova("Разом треба писати всі слова в рядку", "на/чисто, з/ранку, в/основному",
                                  "в/літку, по/тихеньку, на/вічно", "без/упину, на/весні, від/тоді",
                                  "до/нині, за/надто, до/вподоби", 2)
    await db.add_question_to_mova("Букву й треба писати на місці пропуску в усіх словах рядка",
                                  "кромань..онець, сер..озний, бо..овий", "зна..омство, баталь..он, тра..єкторія",
                                  "привіле..ований, гость..овий, буль..он", "шампінь..н, треть..ого, кур..озний", 1)
    await db.add_question_to_mova("НЕМАЄ орфографічних помилок у варіанті",
                                  "Основи правильного харчування та базові фізичні вправи сьогодні знає чи не кожен, хто має бажання почувати себе впевненно за будь яких обставин.",
                                  "Запорукою краси та здоров'я насамперед є збалансованний щоденний рацион та оптимальне фізичне навантаження.",
                                  "Вибір продуктів, технологія приготування страв та особливості споживання їх мають бути підпорядковані правилам здорового харчування.",
                                  "Не зважаючи на розмаїття пропонованих практик здорового харчування, їх об'єднує принцип чіткого поділу продуктів на користні та шкідливі.",
                                  3)
    await db.add_question_to_mova("НЕМАЄ закінчення в обох словах рядка", "співаючи, пальто", "ухвалено, будинок",
                                  "сорок, по-полтавськи", "навперейми, змито", 4)
    await db.add_question_to_mova("Спрощення в групах приголосних треба позначати на письмі в усіх словах рядка",
                                  "блис..нути, улес..ливий, очис..ний, реміс..ник",
                                  "тиж..невий, хрус..нути, балас..ний, провіс..ник",
                                  "доблес..ний, якіс..ний, заздріс..но, випус..ний",
                                  "безшелес..но, гіган..ський, виїз..ний, облас..ний", 1)
    await db.add_question_to_mova("Помилку в написанні слова допущено в рядку", "престиж, риторика, діалог",
                                  "паритет, вінегрет, стиліст", "директор, силікон, дісконт",
                                  "диригент, симфонія, дисплей", 3)
    await db.add_question_to_mova("Букву е на місці пропуску треба писати в усіх словах рядка",
                                  "увеч..рі, увічл..вість, упередж..ний", "оч..видячки, змал..чку, ч..мдуж",
                                  "беззаст..режно, кр..шити, змуш..ний", "б..нтежний, к..рівний, кл..котить", 4)
    await db.add_question_to_mova("Апостроф на місці пропуску треба писати в усіх словах рядка",
                                  "від..ємний, підв..ялити, супер..ядро", "ін..єкційний, між..ярусний, б..ювет",
                                  "з..єднати, кур..йозний, суб..єктивізм", "з..єднати, кур..йозний, суб..єктивізм", 1)
    await db.add_question_to_mova("Дефіс замість скісної риски треба писати в усіх словах рядка",
                                  "суспільно/політичний, суспільно/корисний, суспільно/економічний",
                                  "південно/український, південно/західний, південно/слов’янський",
                                  "садово/городній, садово/декоративний, садово/парковий",
                                  "науково/дослідний, науково/практичний, науково/подібний", 3)
    await db.add_question_to_mova("НЕМАЄ орфографічних помилок у варіанті",
                                  "В Україні за підтримки Організації з безпеки і співробітництва в Європі триває загальнонаціональна кампанія, присвячена питанням кібербезпеки.",
                                  "У межах цих заходів журналіська спільнота отримала відео-ролики з рекомендаціями щодо безпечної поведінки в кіберпросторі.",
                                  "А школярі в усіх регіонах країни ознайомлятся з інфоброшюрами «5 правил захисту інформації від злому в інтернеті» і «5 правил безпечного шопінгу в інтернеті».",
                                  "Зосередженя уваги перед усім на школярах зумовлене їхньою схильністю до необдуманих дій в інтернеті, а отже, беззахисністю перед кібершахраями.",
                                  1)
    await db.add_question_to_mova("Суфікс -ищ- має однакове значення в усіх словах, ОКРІМ", "родовище", "вовчище",
                                  "попелище", "сховище", 2)
    await db.add_question_to_mova("Апостроф треба писати на місці пропуску в усіх словах рядка",
                                  "з..явитися, надвечір..я, ін..єкція", "миш..як, різьб..ярство, нав..ючений",
                                  "В..ячеслав, Св..ятослав, Х..юстон", "під..юдити, грав..юра, слов..янин", 1)
    await db.add_question_to_mova("Лексичну помилку допущено в рядку", "виговор з попередженням",
                                  "запровадження виборності", "оголошення подяки", "оголошення подяки", 1)
    await db.add_question_to_mova("Суфікс -ок має однакове значення в усіх словах, ОКРІМ", "жучок", "жовток", "лужок",
                                  "грибок", 2)
    await db.add_question_to_mova("Синонімами є всі слова в рядку", "говіркий, веселий, радісний",
                                  "карати, мучити, тримати", "деінде, подекуди, зблизька", "артист, лицедій, актор", 4)
    await db.add_question_to_mova("НЕПРАВИЛЬНО узгоджено прикметник з іменником у рядку", "дорожній насип",
                                  "небезпечний кір", "прозорий тюль", "запашний ваніль", 4)
    await db.add_question_to_mova("На перший склад падає наголос у слові", "текстовий", "зручний", "визвольний",
                                  "фаховий", 2)
    await db.add_question_to_mova("На другий склад падає наголос у слові", "бешкет", "вимога", "колесо", "аркушик", 2)
    await db.add_question_to_mova("Кому перед виділеним словом треба поставити в реченні (розділові знаки пропущено)",
                                  "Забудькуватість чомусь завжди сприймають як грім з ясного неба.",
                                  "Спогади традиційно трактують як пасивний розпад інформації.",
                                  "Поступово окремі наші спогади справді вигорають як чорнило на сонці.",
                                  "Пам’ять визначають як властивість мозку діяти за певним стереотипом.", 3)
    await db.add_question_to_mova("У прямому значенні вжито всі прикметники в рядку",
                                  "гострий біль, минулі роки, живильна вода",
                                  "глибоке озеро, золоте слово, жорсткий матрац",
                                  "шовкова хустка, теплі спогади, ясне небо",
                                  "дитячі голоси, свіжий хліб, настільна лампа", 4)
    await db.add_question_to_mova("Суфікс -ик- має однакове значення в усіх словах, ОКРІМ", "вузлик", "лірик", "коник",
                                  "столик", 2)
    await db.add_question_to_mova("Порушено норму узгодження прикметника з іменником у рядку", "щаслива путь",
                                  "струнка фрау", "учена ступінь", "смачна івасі", 3)
    await db.add_question_to_mova("М’який знак треба писати на місці пропуску в обох словах рядка",
                                  "Оксан..чин медал..йон", "бад..орий барабан..щик", "хар..ківський бул..вар",
                                  "трипіл..ська кул..тура", 4)
    await db.add_question_to_mova("Лексичну помилку допущено в рядку", "обсяг продажу", "об’єм басейну",
                                  "змістова доповідь", "програмовий матеріал", 3)
    await db.add_question_to_mova("НЕМАЄ закінчення в обох словах рядка", "далечінь, пюре", "навіки, знаючи",
                                  "хачапурі, честь", "терези, відчувати", 2)
    await db.add_question_to_mova(
        "Граматично НЕПРАВИЛЬНЕ продовження речення «Добираючи збалансовану дієту,..» наведено в рядку",
        "ураховуйте користь її не лише для вашого тіла, а й для розуму.",
        "переконайтеся, що отримаєте достатню кількість необхідних білків.",
        "правильне харчування буде корисним для вашого здоров’я загалом.",
        "до свого раціону додайте овочі й фрукти, багаті на клітковину.", 3)
    await db.add_question_to_mova("Складним є речення",
                                  "Від усього на цьому світі є ліки, немає їх лише від людської глупоти.",
                                  "Суворість учителя, як кажуть, корисніша за поблажливість батьків.",
                                  "У житті кожен може робити добрі справи, не чекаючи на похвалу.",
                                  "Навіть поважні люди, освічені й досвідчені, не завжди перші мудреці.", 1)
    await db.add_question_to_mova("На другий склад падає наголос у слові", "листопад", "поняття", "вантажівка",
                                  "горошина", 2)
    await db.add_question_to_mova("На перший склад падає наголос у всіх словах, ОКРІМ", "причіп", "косий", "жалюзі",
                                  "випадок", 3)
    await db.add_question_to_mova("Вставним словосполученням ускладнено речення (розділові знаки пропущено)",
                                  "За теорією Ч. Дарвіна було знято кілька цікавих науково-популярних фільмів.",
                                  "За теорією Ч. Дарвіна тривалий час уважно слідкували науковці в Кембриджі.",
                                  "За теорією Ч. Дарвіна головною рушійною силою еволюції є природний добір.",
                                  "За теорією Ч. Дарвіна з’явилися й інші пояснення чинників еволюції видів.", 3)
    await db.add_question_to_mova("Антонімами є слова в рядку", "постійний – сталий", "приємний – милий",
                                  "різниця – тотожність", "провісник – предтеча", 3)
    await db.add_question_to_mova("Суфікс -інн(я) має різне значення в словах рядка", "носіння, говоріння",
                                  "гасіння, коріння", "ходіння, шарудіння", "терпіння, водіння", 2)
    await db.add_question_to_mova("Дотримано норми узгодження прикметника з іменником у рядку", "рожеве фламінго",
                                  "прудке кенгуру", "учена ступінь", "високий насип", 4)
    await db.add_question_to_mova("Знак м’якшення треба писати на місці пропуску в усіх словах рядка",
                                  "мистец..кий, учител..ство, камін..чик", "малесен..кий, одягаєт..ся, мен..ший",
                                  "жмен..ці, винос..те, виріз..блений", "він..чати, запоріз..кий, жен..шень", 3)
    await db.add_question_to_mova("Лексичної помилки НЕМАЄ в рядку", "листати сторінки улюбленої книги",
                                  "зранку забули відкрити вікно", "дивовижна пам’ятка природи",
                                  "відноситися з повагою до друзів", 3)
    await db.add_question_to_mova("Помилку в написанні імені по батькові допущено в рядку",
                                  "Валентинівна, Аркадіївна, Ігорівна", "Васильович, Миколайович, Юрієвич",
                                  "Олексіївна, Дмитрівна, Олександрівна", "Якович, Святославович, Анатолійович", 2)
    await db.add_question_to_mova("Правильно написано всі слова в рядку",
                                  "скасований, розтривожений, безтурботний, припинений",
                                  "схвалення, безапеляційний, розмовний, преморожений",
                                  "безконтактний, призвісько, розрекламований, списаний",
                                  "пресмачний, сфотографований, безмірний, росщеплений", 1)
    await db.add_question_to_mova("На другий склад падає наголос у слові", "позначка", "травестія", "рівнина",
                                  "начинка", 3)
    await db.add_question_to_mova("Перевірка",
                                  "Коли мама Ілона Маска переїхала з дітьми до Канади, їй довелося працювати і вдень і вночі.",
                                  "До речі, жінка ніколи не набридала дітям нудними повчаннями щодо навчання й роботи.",
                                  "Вона намагалася бути для родини прикладом в усьому, хоча тепер зауважує, що успіх дітей - лише їхня заслуга.",
                                  "Мати зрідка допомагала дітям, не маючи вільного часу і тому вони досягли всього самостійно.",
                                  4)
    # Питання з наголосом

    await db.add_questions_to_mova_nagolos("На другий склад падає наголос у слові", "черговий", "псевдонім", "ознака",
                                           "осока", 3)
    await db.add_questions_to_mova_nagolos("На третій склад падає наголос у слові", "кропива", "периметр", "підошва",
                                           "однаковий", 1)
    await db.add_questions_to_mova_nagolos("На другий склад падає наголос у слові", "однаковий", "добовий", "щовесни",
                                           "сантиметр", 1)
    await db.add_questions_to_mova_nagolos("На перший склад падає наголос у слові", "жалюзі", "чіткий", "перепис",
                                           "деякий", 4)
    await db.add_questions_to_mova_nagolos("На перший склад падає наголос у слові", "ожеледь", "деінде", "перекис",
                                           "експерт", 1)
    await db.add_questions_to_mova_nagolos("На другий склад падає наголос у слові", "листопад", "новина", "столяр",
                                           "літопис", 4)
    await db.add_questions_to_mova_nagolos("Перший склад наголошений у слові", "розвал", "тонкий", "разом", "люблю", 3)
    await db.add_questions_to_mova_nagolos("Другий склад наголошений у слові", "приятель", "недруг", "відгомін",
                                           "обранець", 4)
    await db.add_questions_to_mova_nagolos("Другий склад наголошений у слові", "запитання", "сантиметр", "одинадцять",
                                           "завдання", 4)
    await db.add_questions_to_mova_nagolos("На перший склад падає наголос у слові", "жалюзі", "випадок", "перепис",
                                           "чіткий", 2)

    await db.add_questions_to_mova_apostrof("Без апострофа треба писати всі слова в рядку",
                                            "верб..я, кур..йозний, тьм..яний", "моркв..яний, розз..явити, цв..яшок",
                                            "дзв..якнути, ін..єкція, різдв..яний",
                                            "дво..ярусний, різьб..яр, Лук..янович",
                                            "духм..яний, присв..ята, прим..ятий", 2)
    await db.add_questions_to_mova_apostrof("Апостроф треба писати на місці обох пропусків рядка", "рел..єф міжгір..я",
                                            "з..їсти пів..яблука", "присв..ятити сім..ї", "сер..йозний об..єкт",
                                            "люб..язна конс..єржка", 2)
    await db.add_questions_to_mova_apostrof("Апостроф треба писати на місці обох пропусків у рядку",
                                            "п..ять відсотків, б..юджетний кодекс",
                                            "розпочинати кар..єру, св..яткові заходи",
                                            "кишеньковий комп..ютер, розв..язати рівняння",
                                            "зар..яджати батарею, громадянське об..єднання",
                                            "опинитися в міжгір..ї, поширити на пів..Європи", 3)
    await db.add_questions_to_mova_apostrof("Апостроф пишеться в усіх словах рядка",
                                            "пів..яблука, марнослів..я, скип..ятити, без..ініціативний",
                                            "львів..янин, підрум..янений, з..являтися, ф..юзеляж",
                                            "подвір..я, пан..європейський, р..яжанка, трав..янистий",
                                            "торф..яний, між..ярусний, кон..юнктура, дев..яносто",
                                            "Лук..яненко, Св..ятослав, Мар..яна, Карп..юк", 4)
    await db.add_questions_to_mova_apostrof("Апостроф на місці пропуску треба писати в усіх словах рядка",
                                            "черв..ячок, в..юнкий, р..юмсати", "без..іменний, п..єса, з..єднаний",
                                            "пір..їнка, трав..янистий, зів..яти", "міл..ярд, жнив..яний, пред..явник",
                                            "в..юнкий, духм..яний, торф..яний", 3)
    await db.add_questions_to_mova_apostrof("Апостроф пишеться в усіх словах рядка",
                                            "відв..язати, п..юре, Лук..яненко, м..ята",
                                            "верф..ю, транс..європейський, кон..юнктура, дзв..якати",
                                            "к..юрі, інтерв..ю, відіб..ється, з..явитися",
                                            "тім..я, від..їжджати, возз..єднання, ін..єкція",
                                            "М..юнхен, під..юджувати, верб..я, подвір..я", 4)
    await db.add_questions_to_mova_apostrof("Апостроф пишеться в усіх словах рядка",
                                            "верхів..я, довір..я, різдв..яний, пов..язаний",
                                            "круп..є, міжбрів..я, р..яска, з..юрмитися",
                                            "мін..юст, верб..я, перемир..я, інтерв..ю",
                                            "сузір..я, під..яремний, зв..язківець, б..юджет",
                                            "зав..язь, роз..єднати, ін..єкція, бр..яжчати", 3)
    await db.add_questions_to_mova_apostrof("Апостроф на місці крапок треба ставити в усіх словах рядка",
                                            "під..яремний, краков..як, рутв..яний",
                                            "П..ятихатки, без..язикий, брукв..яний",
                                            "розіб..єш, з..єднаний, присв..ятити",
                                            "об..їжджати, Лук..янівка, сер..йозний",
                                            "сором..язливий, пів..юрби, зап..ястя", 5)
    await db.add_questions_to_mova_apostrof("Апостроф треба писати на місці пропуску в усіх словах рядка, ОКРІМ",
                                            "розм..якнути, бультер..єр, Лук..ян, різнобарв..я",
                                            "рум..янець, кон..юнктивіт, інтерв..ю, В..єтнам",
                                            "відв..язати, дит..ясла, бар..єрний, Аліґ..єрі",
                                            "солов..їний, Мін..юст, інтер..єр, між..ярусний",
                                            "подвір..я, об..єднання, пів..юрти, пів..Європи", 5)
    await db.add_questions_to_mova_apostrof("Апостроф на місці пропуску треба писати в усіх словах рядка",
                                            "зім..ятий, реп..ях, жираф..ячий", "матір..ю, між..ярусний, бур..ячок",
                                            "з..єднати, кур..йозний, міжгір..я", "тім..я, розв..язання, св..ятковий",
                                            "кав..ярня, черв..як, медв..яний", 1)


db = Database()
loop = asyncio.get_event_loop()
loop.run_until_complete(test())
